; ModuleID = 'example.c'
source_filename = "example.c"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx13.0.0"

%struct.string_list_item = type { i8*, i8* }
%struct.menu_stuff = type { i32, i32, i8* }
%struct.menu_item = type { i8, i8*, i32, i32 ()* }
%struct.string_list = type { %struct.string_list_item*, i64, i64, i8 }

@.str.1 = private unnamed_addr constant [2 x i8] c"a\00", align 1
@.str.2 = private unnamed_addr constant [2 x i8] c"b\00", align 1
@__const.main.items = private unnamed_addr constant [2 x %struct.string_list_item] [%struct.string_list_item { i8* getelementptr inbounds ([2 x i8], [2 x i8]* @.str.1, i32 0, i32 0), i8* null }, %struct.string_list_item { i8* getelementptr inbounds ([2 x i8], [2 x i8]* @.str.2, i32 0, i32 0), i8* null }], align 16

; Function Attrs: noinline noreturn nounwind ssp uwtable
define void @die(i8* nocapture readnone %err, ...) local_unnamed_addr #0 !dbg !48 {
entry:
  call void @llvm.dbg.value(metadata i8* undef, metadata !52, metadata !DIExpression()), !dbg !53
  call void @exit(i32 1) #10, !dbg !54
  unreachable, !dbg !54
}

; Function Attrs: mustprogress nofree nosync nounwind readnone speculatable willreturn
declare void @llvm.dbg.declare(metadata, metadata, metadata) #1

; Function Attrs: noreturn
declare void @exit(i32) local_unnamed_addr #2

; Function Attrs: noinline nounwind ssp uwtable

!0 = !{i32 2, !"SDK Version", [2 x i32] [i32 13, i32 1]}
!1 = !{i32 7, !"Dwarf Version", i32 4}
!2 = !{i32 2, !"Debug Info Version", i32 3}
!3 = !{i32 1, !"wchar_size", i32 4}
!4 = !{i32 7, !"PIC Level", i32 2}
!5 = !{i32 7, !"uwtable", i32 1}
!6 = !{i32 7, !"frame-pointer", i32 2}
!7 = distinct !DICompileUnit(language: DW_LANG_C99, file: !8, producer: "clang version 13.0.0 (git@github.com:llvm/llvm-project.git d7b669b3a30345cfcdb2fde2af6f48aa4b94845d)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !9, retainedTypes: !15, splitDebugInlining: false, nameTableKind: None, sysroot: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk", sdk: "MacOSX.sdk")
!8 = !DIFile(filename: "example.c", directory: "/Users/jryans/Projects/Malleable/Experiments/Debug Info/Issues/Git/find-unique")
!9 = !{!10}
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "menu_stuff_type", file: !8, line: 33, baseType: !11, size: 32, elements: !12)
!11 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!12 = !{!13, !14}
!13 = !DIEnumerator(name: "MENU_STUFF_TYPE_STRING_LIST", value: 1)
!14 = !DIEnumerator(name: "MENU_STUFF_TYPE_MENU_ITEM", value: 2)
!15 = !{!16, !30}
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "menu_item", file: !8, line: 26, size: 256, elements: !18)
!18 = !{!19, !21, !24, !26}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "hotkey", scope: !17, file: !8, line: 27, baseType: !20, size: 8)
!20 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !17, file: !8, line: 28, baseType: !22, size: 64, offset: 64)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "selected", scope: !17, file: !8, line: 29, baseType: !25, size: 32, offset: 128)
!25 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !17, file: !8, line: 30, baseType: !27, size: 64, offset: 192)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = !DISubroutineType(types: !29)
!29 = !{!25}
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "string_list", file: !8, line: 17, size: 256, elements: !32)
!32 = !{!33, !41, !45, !46}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !31, file: !8, line: 18, baseType: !34, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "string_list_item", file: !8, line: 12, size: 128, elements: !36)
!36 = !{!37, !39}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !35, file: !8, line: 13, baseType: !38, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "util", scope: !35, file: !8, line: 14, baseType: !40, size: 64, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !31, file: !8, line: 19, baseType: !42, size: 64, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !43, line: 46, baseType: !44)
!43 = !DIFile(filename: "LLVM/llvm/build-release-clang-lldb-13.0.0/lib/clang/13.0.0/include/stddef.h", directory: "/Users/jryans/Projects")
!44 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !31, file: !8, line: 20, baseType: !42, size: 64, offset: 128)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "strdup_strings", scope: !31, file: !8, line: 21, baseType: !11, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!47 = !{!"clang version 13.0.0 (git@github.com:llvm/llvm-project.git d7b669b3a30345cfcdb2fde2af6f48aa4b94845d)"}
!48 = distinct !DISubprogram(name: "die", scope: !8, file: !8, line: 6, type: !49, scopeLine: 6, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !7, retainedNodes: !51)
!49 = !DISubroutineType(types: !50)
!50 = !{null, !22, null}
!51 = !{!52}
!52 = !DILocalVariable(name: "err", arg: 1, scope: !48, file: !8, line: 6, type: !22)
!53 = !DILocation(line: 0, scope: !48)
!54 = !DILocation(line: 7, column: 3, scope: !48)
!55 = distinct !DISubprogram(name: "find_unique", scope: !8, file: !8, line: 44, type: !56, scopeLine: 45, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !7, retainedNodes: !64)
!56 = !DISubroutineType(types: !57)
!57 = !{!25, !22, !58}
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "menu_stuff", file: !8, line: 38, size: 128, elements: !60)
!60 = !{!61, !62, !63}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !59, file: !8, line: 39, baseType: !10, size: 32)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !59, file: !8, line: 40, baseType: !25, size: 32, offset: 32)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "stuff", scope: !59, file: !8, line: 41, baseType: !40, size: 64, offset: 64)
!64 = !{!65, !66, !67, !68, !69, !70, !71}
!65 = !DILocalVariable(name: "choice", arg: 1, scope: !55, file: !8, line: 44, type: !22)
!66 = !DILocalVariable(name: "menu_stuff", arg: 2, scope: !55, file: !8, line: 44, type: !58)
!67 = !DILocalVariable(name: "menu_item", scope: !55, file: !8, line: 46, type: !16)
!68 = !DILocalVariable(name: "string_list_item", scope: !55, file: !8, line: 47, type: !34)
!69 = !DILocalVariable(name: "i", scope: !55, file: !8, line: 48, type: !25)
!70 = !DILocalVariable(name: "len", scope: !55, file: !8, line: 48, type: !25)
!71 = !DILocalVariable(name: "found", scope: !55, file: !8, line: 48, type: !25)
!72 = !DILocation(line: 0, scope: !55)
!73 = !DILocation(line: 50, column: 9, scope: !55)
!74 = !DILocation(line: 51, column: 23, scope: !55)
!75 = !{!76, !77, i64 0}
!76 = !{!"menu_stuff", !77, i64 0, !79, i64 4, !80, i64 8}
!77 = !{!"omnipotent char", !78, i64 0}
!78 = !{!"Simple C/C++ TBAA"}
!79 = !{!"int", !77, i64 0}
!80 = !{!"any pointer", !77, i64 0}
!81 = !DILocation(line: 51, column: 3, scope: !55)
!82 = !DILocation(line: 53, column: 5, scope: !83)
!83 = distinct !DILexicalBlock(scope: !55, file: !8, line: 51, column: 29)
!84 = !{!76, !79, i64 4}
!85 = !DILocation(line: 57, column: 19, scope: !86)
!86 = distinct !DILexicalBlock(scope: !87, file: !8, line: 57, column: 5)
!87 = distinct !DILexicalBlock(scope: !83, file: !8, line: 57, column: 5)
!88 = !DILocation(line: 57, column: 5, scope: !87)
!89 = !DILocation(line: 56, column: 49, scope: !83)
!90 = !{!76, !80, i64 8}
!91 = !DILocation(line: 58, column: 20, scope: !92)
!92 = distinct !DILexicalBlock(scope: !93, file: !8, line: 58, column: 11)
!93 = distinct !DILexicalBlock(scope: !86, file: !8, line: 57, column: 55)
!94 = !DILocation(line: 58, column: 23, scope: !92)
!95 = !{!77, !77, i64 0}
!96 = !DILocation(line: 58, column: 45, scope: !92)
!97 = !{!98, !77, i64 0}
!98 = !{!"menu_item", !77, i64 0, !80, i64 8, !79, i64 16, !80, i64 24}
!99 = !DILocation(line: 58, column: 31, scope: !92)
!100 = !DILocation(line: 58, column: 11, scope: !93)
!101 = !DILocation(line: 59, column: 19, scope: !102)
!102 = distinct !DILexicalBlock(scope: !92, file: !8, line: 58, column: 53)
!103 = !DILocation(line: 60, column: 9, scope: !102)
!104 = !DILocation(line: 62, column: 43, scope: !105)
!105 = distinct !DILexicalBlock(scope: !93, file: !8, line: 62, column: 11)
!106 = !{!98, !80, i64 8}
!107 = !DILocation(line: 62, column: 12, scope: !105)
!108 = !DILocation(line: 62, column: 11, scope: !93)
!109 = !DILocation(line: 63, column: 13, scope: !110)
!110 = distinct !DILexicalBlock(scope: !111, file: !8, line: 63, column: 13)
!111 = distinct !DILexicalBlock(scope: !105, file: !8, line: 62, column: 56)
!112 = !DILocation(line: 63, column: 13, scope: !111)
!113 = !DILocation(line: 64, column: 15, scope: !114)
!114 = distinct !DILexicalBlock(scope: !110, file: !8, line: 63, column: 20)
!115 = !DILocation(line: 72, column: 21, scope: !116)
!116 = distinct !DILexicalBlock(scope: !110, file: !8, line: 71, column: 16)
!117 = !DILocation(line: 57, column: 38, scope: !86)
!118 = !DILocation(line: 57, column: 51, scope: !86)
!119 = distinct !{!119, !88, !120, !121, !122}
!120 = !DILocation(line: 75, column: 5, scope: !87)
!121 = !{!"llvm.loop.mustprogress"}
!122 = !{!"llvm.loop.unroll.disable"}
!123 = !DILocation(line: 79, column: 19, scope: !124)
!124 = distinct !DILexicalBlock(scope: !125, file: !8, line: 79, column: 5)
!125 = distinct !DILexicalBlock(scope: !83, file: !8, line: 79, column: 5)
!126 = !DILocation(line: 79, column: 5, scope: !125)
!127 = !DILocation(line: 78, column: 59, scope: !83)
!128 = !DILocation(line: 78, column: 67, scope: !83)
!129 = !{!130, !80, i64 0}
!130 = !{!"string_list", !80, i64 0, !131, i64 8, !131, i64 16, !79, i64 24}
!131 = !{!"long", !77, i64 0}
!132 = !DILocation(line: 80, column: 50, scope: !133)
