; ModuleID = 'example.c'
source_filename = "example.c"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx14.0.0"

%struct.s102 = type { i32, [2 x [2 x i32]] }
%struct.s201 = type { i32, [2 x [2 x i32]] }
%struct.s202 = type { %struct.anon, [2 x [2 x i32]] }
%struct.anon = type { i32 }
%struct.s203 = type { [4 x i32], [2 x [2 x i32]] }
%struct.s204 = type { i32, [0 x i32] }
%struct.s205 = type { i32*, [2 x [2 x i32]] }
%struct.s206 = type { i32*, i32*, [2 x [2 x i32]] }
%struct.s207 = type { i32*, [2 x [2 x i32]] }
%struct.s208 = type { i32 (...)*, [2 x [2 x i32]] }
%struct.s301 = type { [4 x i32], [2 x [2 x i32]] }
%struct.s302 = type { [4 x %struct.anon.0], [2 x [2 x i32]] }
%struct.anon.0 = type { i32 }
%struct.s303 = type { [4 x [4 x i32]] }
%struct.s305 = type { [4 x i32*] }
%struct.s306 = type { [4 x i32*] }
%struct.s307 = type { [4 x i32*] }
%struct.s308 = type { [4 x i32 (...)*] }
%struct.s402 = type { i32 }
%struct.s501 = type { %struct.anon.1 }
%struct.anon.1 = type { [4 x i32*] }
%struct.s502 = type { [4 x %struct.anon.2] }
%struct.anon.2 = type { i32* }

; Function Attrs: noinline nounwind ssp uwtable
define i32 @ex101Int(i32 %a) #0 !dbg !15 {
entry:
  %a.addr = alloca i32, align 4
  store i32 %a, i32* %a.addr, align 4
  call void @llvm.dbg.declare(metadata i32* %a.addr, metadata !18, metadata !DIExpression()), !dbg !19
  %0 = load i32, i32* %a.addr, align 4, !dbg !20

!0 = !{i32 2, !"SDK Version", [2 x i32] [i32 14, i32 5]}
!1 = !{i32 7, !"Dwarf Version", i32 4}
!2 = !{i32 2, !"Debug Info Version", i32 3}
!3 = !{i32 1, !"wchar_size", i32 4}
!4 = !{i32 7, !"PIC Level", i32 2}
!5 = !{i32 7, !"uwtable", i32 1}
!6 = !{i32 7, !"frame-pointer", i32 2}
!7 = distinct !DICompileUnit(language: DW_LANG_C99, file: !8, producer: "clang version 13.0.0 (git@github.com:llvm/llvm-project.git d7b669b3a30345cfcdb2fde2af6f48aa4b94845d)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !9, retainedTypes: !10, splitDebugInlining: false, nameTableKind: None, sysroot: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk", sdk: "MacOSX.sdk")
!8 = !DIFile(filename: "example.c", directory: "/Users/jryans/Projects/Malleable/Experiments/Debug Info/Issues/basic/types")
!9 = !{}
!10 = !{!11, !12}
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!14 = !{!"clang version 13.0.0 (git@github.com:llvm/llvm-project.git d7b669b3a30345cfcdb2fde2af6f48aa4b94845d)"}
!15 = distinct !DISubprogram(name: "ex101Int", scope: !8, file: !8, line: 7, type: !16, scopeLine: 7, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !9)
!16 = !DISubroutineType(types: !17)
!17 = !{!13, !13}
!18 = !DILocalVariable(name: "a", arg: 1, scope: !15, file: !8, line: 7, type: !13)
!19 = !DILocation(line: 7, column: 18, scope: !15)
!20 = !DILocation(line: 8, column: 10, scope: !15)
!21 = !DILocation(line: 8, column: 3, scope: !15)
!22 = distinct !DISubprogram(name: "ex102Struct", scope: !8, file: !8, line: 15, type: !23, scopeLine: 15, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !9)
!23 = !DISubroutineType(types: !24)
!24 = !{!13, !25}
!25 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "s102", file: !8, line: 11, size: 160, elements: !26)
!26 = !{!27, !28}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !25, file: !8, line: 12, baseType: !13, size: 32)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_", scope: !25, file: !8, line: 13, baseType: !29, size: 128, offset: 32)
!29 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 128, elements: !30)
!30 = !{!31, !31}
!31 = !DISubrange(count: 2)
!32 = !DILocalVariable(name: "s", arg: 1, scope: !22, file: !8, line: 15, type: !25)
!33 = !DILocation(line: 15, column: 29, scope: !22)
!34 = !DILocation(line: 16, column: 12, scope: !22)
!35 = !DILocation(line: 16, column: 3, scope: !22)
!36 = distinct !DISubprogram(name: "ex105PointerSingleElementValue", scope: !8, file: !8, line: 21, type: !37, scopeLine: 21, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !9)
!37 = !DISubroutineType(types: !38)
!38 = !{!13, !12}
!39 = !DILocalVariable(name: "a", arg: 1, scope: !36, file: !8, line: 21, type: !12)
!40 = !DILocation(line: 21, column: 41, scope: !36)
!41 = !DILocation(line: 22, column: 11, scope: !36)
!42 = !DILocation(line: 22, column: 10, scope: !36)
!43 = !DILocation(line: 22, column: 3, scope: !36)
!44 = distinct !DISubprogram(name: "ex106PointerSingleElementInstances", scope: !8, file: !8, line: 25, type: !45, scopeLine: 25, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !9)
!45 = !DISubroutineType(types: !46)
!46 = !{!13, !12, !12}
!47 = !DILocalVariable(name: "a", arg: 1, scope: !44, file: !8, line: 25, type: !12)
!48 = !DILocation(line: 25, column: 45, scope: !44)
!49 = !DILocalVariable(name: "b", arg: 2, scope: !44, file: !8, line: 25, type: !12)
!50 = !DILocation(line: 25, column: 53, scope: !44)
!51 = !DILocation(line: 26, column: 7, scope: !52)
!52 = distinct !DILexicalBlock(scope: !44, file: !8, line: 26, column: 7)
!53 = !DILocation(line: 26, column: 9, scope: !52)
!54 = !DILocation(line: 26, column: 17, scope: !52)
!55 = !DILocation(line: 26, column: 20, scope: !52)
!56 = !DILocation(line: 26, column: 22, scope: !52)
!57 = !DILocation(line: 26, column: 7, scope: !44)
!58 = !DILocation(line: 28, column: 5, scope: !59)
!59 = distinct !DILexicalBlock(scope: !52, file: !8, line: 26, column: 31)
!60 = !DILocation(line: 29, column: 14, scope: !61)
!61 = distinct !DILexicalBlock(scope: !52, file: !8, line: 29, column: 14)
!62 = !DILocation(line: 29, column: 19, scope: !61)
!63 = !DILocation(line: 29, column: 16, scope: !61)
!64 = !DILocation(line: 29, column: 14, scope: !52)
!65 = !DILocation(line: 30, column: 5, scope: !66)
!66 = distinct !DILexicalBlock(scope: !61, file: !8, line: 29, column: 22)
!67 = !DILocation(line: 33, column: 5, scope: !68)
!68 = distinct !DILexicalBlock(scope: !61, file: !8, line: 31, column: 10)
!69 = !DILocation(line: 35, column: 1, scope: !44)
!70 = distinct !DISubprogram(name: "ex107PointerMultipleElementValues", scope: !8, file: !8, line: 37, type: !37, scopeLine: 37, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !9)
!71 = !DILocalVariable(name: "a", arg: 1, scope: !70, file: !8, line: 37, type: !12)
!72 = !DILocation(line: 37, column: 44, scope: !70)
!73 = !DILocation(line: 39, column: 10, scope: !70)
!74 = !DILocation(line: 39, column: 17, scope: !70)
!75 = !DILocation(line: 39, column: 15, scope: !70)
!76 = !DILocation(line: 39, column: 3, scope: !70)
!77 = distinct !DISubprogram(name: "ex108PointerFunction", scope: !8, file: !8, line: 42, type: !78, scopeLine: 42, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !9)
!78 = !DISubroutineType(types: !79)
!79 = !{!13, !80}
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DISubroutineType(types: !82)
!82 = !{!13, null}
!83 = !DILocalVariable(name: "a", arg: 1, scope: !77, file: !8, line: 42, type: !80)
!84 = !DILocation(line: 42, column: 32, scope: !77)
!85 = !DILocation(line: 44, column: 10, scope: !77)
!86 = !DILocation(line: 44, column: 3, scope: !77)
!87 = distinct !DISubprogram(name: "ex201StructFieldInt", scope: !8, file: !8, line: 53, type: !88, scopeLine: 53, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !9)
!88 = !DISubroutineType(types: !89)
!89 = !{!13, !90}
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "s201", file: !8, line: 49, size: 160, elements: !91)
!91 = !{!92, !93}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !90, file: !8, line: 50, baseType: !13, size: 32)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_", scope: !90, file: !8, line: 51, baseType: !29, size: 128, offset: 32)
!94 = !DILocalVariable(name: "s", arg: 1, scope: !87, file: !8, line: 53, type: !90)
!95 = !DILocation(line: 53, column: 37, scope: !87)
!96 = !DILocation(line: 54, column: 12, scope: !87)
!97 = !DILocation(line: 54, column: 3, scope: !87)
!98 = distinct !DISubprogram(name: "ex202StructFieldStruct", scope: !8, file: !8, line: 63, type: !99, scopeLine: 63, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !9)
!99 = !DISubroutineType(types: !100)
!100 = !{!13, !101}
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "s202", file: !8, line: 57, size: 160, elements: !102)
!102 = !{!103, !107}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !101, file: !8, line: 60, baseType: !104, size: 32)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !101, file: !8, line: 58, size: 32, elements: !105)
!105 = !{!106}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !104, file: !8, line: 59, baseType: !13, size: 32)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_", scope: !101, file: !8, line: 61, baseType: !29, size: 128, offset: 32)
!108 = !DILocalVariable(name: "s", arg: 1, scope: !98, file: !8, line: 63, type: !101)
!109 = !DILocation(line: 63, column: 40, scope: !98)
!110 = !DILocation(line: 64, column: 12, scope: !98)
!111 = !DILocation(line: 64, column: 18, scope: !98)
!112 = !DILocation(line: 64, column: 3, scope: !98)
!113 = distinct !DISubprogram(name: "ex203StructFieldArrayFixedLength", scope: !8, file: !8, line: 71, type: !114, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !9)
!114 = !DISubroutineType(types: !115)
!115 = !{!13, !116}
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "s203", file: !8, line: 67, size: 256, elements: !117)
!117 = !{!118, !122}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !116, file: !8, line: 68, baseType: !119, size: 128)
!119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 128, elements: !120)
!120 = !{!121}
!121 = !DISubrange(count: 4)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_", scope: !116, file: !8, line: 69, baseType: !29, size: 128, offset: 128)
!123 = !DILocalVariable(name: "s", arg: 1, scope: !113, file: !8, line: 71, type: !116)
!124 = !DILocation(line: 71, column: 50, scope: !113)
!125 = !DILocation(line: 72, column: 12, scope: !113)
!126 = !DILocation(line: 72, column: 10, scope: !113)
!127 = !DILocation(line: 72, column: 21, scope: !113)
!128 = !DILocation(line: 72, column: 19, scope: !113)
!129 = !DILocation(line: 72, column: 17, scope: !113)
!130 = !DILocation(line: 72, column: 3, scope: !113)
!131 = distinct !DISubprogram(name: "ex204StructFieldArrayVariableLength", scope: !8, file: !8, line: 79, type: !132, scopeLine: 79, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !9)
!132 = !DISubroutineType(types: !133)
!133 = !{!13, !134}
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "s204", file: !8, line: 75, size: 32, elements: !135)
!135 = !{!136, !137}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "placeholder", scope: !134, file: !8, line: 76, baseType: !13, size: 32)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !134, file: !8, line: 77, baseType: !138, offset: 32)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, elements: !139)
!139 = !{!140}
!140 = !DISubrange(count: -1)
!141 = !DILocalVariable(name: "s", arg: 1, scope: !131, file: !8, line: 79, type: !134)
!142 = !DILocation(line: 79, column: 53, scope: !131)
!143 = !DILocation(line: 80, column: 12, scope: !131)
!144 = !DILocation(line: 80, column: 10, scope: !131)
!145 = !DILocation(line: 80, column: 21, scope: !131)
!146 = !DILocation(line: 80, column: 19, scope: !131)
!147 = !DILocation(line: 80, column: 17, scope: !131)
!148 = !DILocation(line: 80, column: 3, scope: !131)
!149 = distinct !DISubprogram(name: "ex205StructFieldPointerSingleElementValue", scope: !8, file: !8, line: 87, type: !150, scopeLine: 87, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !9)
!150 = !DISubroutineType(types: !151)
!151 = !{!13, !152}
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "s205", file: !8, line: 83, size: 192, elements: !153)
!153 = !{!154, !155}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !152, file: !8, line: 84, baseType: !12, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_", scope: !152, file: !8, line: 85, baseType: !29, size: 128, offset: 64)
!156 = !DILocalVariable(name: "s", arg: 1, scope: !149, file: !8, line: 87, type: !152)
!157 = !DILocation(line: 87, column: 59, scope: !149)
!158 = !DILocation(line: 88, column: 13, scope: !149)
!159 = !DILocation(line: 88, column: 10, scope: !149)
!160 = !DILocation(line: 88, column: 3, scope: !149)
!161 = distinct !DISubprogram(name: "ex206StructFieldPointerSingleElementInstances", scope: !8, file: !8, line: 96, type: !162, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !9)
!162 = !DISubroutineType(types: !163)
!163 = !{!13, !164}
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "s206", file: !8, line: 91, size: 256, elements: !165)
!165 = !{!166, !167, !168}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !164, file: !8, line: 92, baseType: !12, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !164, file: !8, line: 93, baseType: !12, size: 64, offset: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_", scope: !164, file: !8, line: 94, baseType: !29, size: 128, offset: 128)
!169 = !DILocalVariable(name: "s", arg: 1, scope: !161, file: !8, line: 96, type: !164)
!170 = !DILocation(line: 96, column: 63, scope: !161)
!171 = !DILocation(line: 97, column: 9, scope: !172)
!172 = distinct !DILexicalBlock(scope: !161, file: !8, line: 97, column: 7)
!173 = !DILocation(line: 97, column: 11, scope: !172)
!174 = !DILocation(line: 97, column: 19, scope: !172)
!175 = !DILocation(line: 97, column: 24, scope: !172)
!176 = !DILocation(line: 97, column: 26, scope: !172)
!177 = !DILocation(line: 97, column: 7, scope: !161)
!178 = !DILocation(line: 99, column: 5, scope: !179)
!179 = distinct !DILexicalBlock(scope: !172, file: !8, line: 97, column: 35)
!180 = !DILocation(line: 100, column: 16, scope: !181)
!181 = distinct !DILexicalBlock(scope: !172, file: !8, line: 100, column: 14)
!182 = !DILocation(line: 100, column: 23, scope: !181)
!183 = !DILocation(line: 100, column: 18, scope: !181)
!184 = !DILocation(line: 100, column: 14, scope: !172)
!185 = !DILocation(line: 101, column: 5, scope: !186)
!186 = distinct !DILexicalBlock(scope: !181, file: !8, line: 100, column: 26)
!187 = !DILocation(line: 104, column: 5, scope: !188)
!188 = distinct !DILexicalBlock(scope: !181, file: !8, line: 102, column: 10)
!189 = !DILocation(line: 106, column: 1, scope: !161)
!190 = distinct !DISubprogram(name: "ex207StructFieldPointerMultipleElementValues", scope: !8, file: !8, line: 112, type: !191, scopeLine: 112, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !9)
!191 = !DISubroutineType(types: !192)
!192 = !{!13, !193}
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "s207", file: !8, line: 108, size: 192, elements: !194)
!194 = !{!195, !196}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !193, file: !8, line: 109, baseType: !12, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_", scope: !193, file: !8, line: 110, baseType: !29, size: 128, offset: 64)
!197 = !DILocalVariable(name: "s", arg: 1, scope: !190, file: !8, line: 112, type: !193)
!198 = !DILocation(line: 112, column: 62, scope: !190)
!199 = !DILocation(line: 114, column: 12, scope: !190)
!200 = !DILocation(line: 114, column: 10, scope: !190)
!201 = !DILocation(line: 114, column: 21, scope: !190)
!202 = !DILocation(line: 114, column: 19, scope: !190)
!203 = !DILocation(line: 114, column: 17, scope: !190)
!204 = !DILocation(line: 114, column: 3, scope: !190)
!205 = distinct !DISubprogram(name: "ex208StructFieldPointerFunction", scope: !8, file: !8, line: 121, type: !206, scopeLine: 121, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !9)
!206 = !DISubroutineType(types: !207)
!207 = !{!13, !208}
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "s208", file: !8, line: 117, size: 192, elements: !209)
!209 = !{!210, !211}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !208, file: !8, line: 118, baseType: !80, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "_", scope: !208, file: !8, line: 119, baseType: !29, size: 128, offset: 64)
!212 = !DILocalVariable(name: "s", arg: 1, scope: !205, file: !8, line: 121, type: !208)
!213 = !DILocation(line: 121, column: 49, scope: !205)
!214 = !DILocation(line: 123, column: 12, scope: !205)
!215 = !DILocation(line: 123, column: 10, scope: !205)
!216 = !DILocation(line: 123, column: 3, scope: !205)
!217 = distinct !DISubprogram(name: "ex301ArrayElemInt", scope: !8, file: !8, line: 132, type: !218, scopeLine: 132, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !9)
!218 = !DISubroutineType(types: !219)
!219 = !{!13, !220}
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "s301", file: !8, line: 128, size: 256, elements: !221)
!221 = !{!222, !223}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !220, file: !8, line: 129, baseType: !119, size: 128)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_", scope: !220, file: !8, line: 130, baseType: !29, size: 128, offset: 128)
!224 = !DILocalVariable(name: "s", arg: 1, scope: !217, file: !8, line: 132, type: !220)
!225 = !DILocation(line: 132, column: 35, scope: !217)
!226 = !DILocation(line: 133, column: 12, scope: !217)
!227 = !DILocation(line: 133, column: 10, scope: !217)
!228 = !DILocation(line: 133, column: 21, scope: !217)
!229 = !DILocation(line: 133, column: 19, scope: !217)
!230 = !DILocation(line: 133, column: 17, scope: !217)
!231 = !DILocation(line: 133, column: 3, scope: !217)
!232 = distinct !DISubprogram(name: "ex302ArrayElemStruct", scope: !8, file: !8, line: 142, type: !233, scopeLine: 142, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !9)
!233 = !DISubroutineType(types: !234)
!234 = !{!13, !235}
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "s302", file: !8, line: 136, size: 256, elements: !236)
!236 = !{!237, !242}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !235, file: !8, line: 139, baseType: !238, size: 128)
!238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !239, size: 128, elements: !120)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !235, file: !8, line: 137, size: 32, elements: !240)
!240 = !{!241}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !239, file: !8, line: 138, baseType: !13, size: 32)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_", scope: !235, file: !8, line: 140, baseType: !29, size: 128, offset: 128)
!243 = !DILocalVariable(name: "s", arg: 1, scope: !232, file: !8, line: 142, type: !235)
!244 = !DILocation(line: 142, column: 38, scope: !232)
!245 = !DILocation(line: 143, column: 12, scope: !232)
!246 = !DILocation(line: 143, column: 10, scope: !232)
!247 = !DILocation(line: 143, column: 21, scope: !232)
!248 = !DILocation(line: 143, column: 27, scope: !232)
!249 = !DILocation(line: 143, column: 25, scope: !232)
!250 = !DILocation(line: 143, column: 36, scope: !232)
!251 = !DILocation(line: 143, column: 23, scope: !232)
!252 = !DILocation(line: 143, column: 3, scope: !232)
!253 = distinct !DISubprogram(name: "ex303ArrayElemArrayFixedLength", scope: !8, file: !8, line: 149, type: !254, scopeLine: 149, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !9)
!254 = !DISubroutineType(types: !255)
!255 = !{!13, !256}
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "s303", file: !8, line: 146, size: 512, elements: !257)
!257 = !{!258}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !256, file: !8, line: 147, baseType: !259, size: 512)
!259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 512, elements: !260)
!260 = !{!121, !121}
!261 = !DILocalVariable(name: "s", arg: 1, scope: !253, file: !8, line: 149, type: !256)
!262 = !DILocation(line: 149, column: 48, scope: !253)
!263 = !DILocation(line: 150, column: 12, scope: !253)
!264 = !DILocation(line: 150, column: 10, scope: !253)
!265 = !DILocation(line: 150, column: 24, scope: !253)
!266 = !DILocation(line: 150, column: 22, scope: !253)
!267 = !DILocation(line: 150, column: 20, scope: !253)
!268 = !DILocation(line: 150, column: 3, scope: !253)
!269 = distinct !DISubprogram(name: "ex305ArrayElemPointerSingleElementValue", scope: !8, file: !8, line: 158, type: !270, scopeLine: 158, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !9)
!270 = !DISubroutineType(types: !271)
!271 = !{!13, !272}
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "s305", file: !8, line: 155, size: 256, elements: !273)
!273 = !{!274}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !272, file: !8, line: 156, baseType: !275, size: 256)
!275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 256, elements: !120)
!276 = !DILocalVariable(name: "s", arg: 1, scope: !269, file: !8, line: 158, type: !272)
!277 = !DILocation(line: 158, column: 57, scope: !269)
!278 = !DILocation(line: 159, column: 13, scope: !269)
!279 = !DILocation(line: 159, column: 11, scope: !269)
!280 = !DILocation(line: 159, column: 10, scope: !269)
!281 = !DILocation(line: 159, column: 3, scope: !269)
!282 = distinct !DISubprogram(name: "ex306ArrayElemPointerSingleElementInstances", scope: !8, file: !8, line: 165, type: !283, scopeLine: 165, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !9)
!283 = !DISubroutineType(types: !284)
!284 = !{!13, !285}
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "s306", file: !8, line: 162, size: 256, elements: !286)
!286 = !{!287}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !285, file: !8, line: 163, baseType: !275, size: 256)
!288 = !DILocalVariable(name: "s", arg: 1, scope: !282, file: !8, line: 165, type: !285)
!289 = !DILocation(line: 165, column: 61, scope: !282)
!290 = !DILocation(line: 166, column: 9, scope: !291)
!291 = distinct !DILexicalBlock(scope: !282, file: !8, line: 166, column: 7)
!292 = !DILocation(line: 166, column: 7, scope: !291)
!293 = !DILocation(line: 166, column: 14, scope: !291)
!294 = !DILocation(line: 166, column: 22, scope: !291)
!295 = !DILocation(line: 166, column: 27, scope: !291)
!296 = !DILocation(line: 166, column: 25, scope: !291)
!297 = !DILocation(line: 166, column: 32, scope: !291)
!298 = !DILocation(line: 166, column: 7, scope: !282)
