; ModuleID = '/var/folders/j6/jhbppx_x1050lwg8bmjxkt240000gp/T/compiler-explorer-compiler2023613-70730-os0cv8.i1wh/example.ll'
source_filename = "/var/folders/j6/jhbppx_x1050lwg8bmjxkt240000gp/T/compiler-explorer-compiler2023613-70730-zq61cy.18ivh/example.c"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx13.0.0"

%struct.git_hash_algo = type { i8*, i32, i64, i64, i64, %struct.object_id*, %struct.object_id*, %struct.object_id* }
%struct.object_id = type { [32 x i8], i32 }
%struct.hashfile = type { i32, i32, i32, %struct.progress*, i8*, i32, i32, i64, i8*, i8* }
%struct.progress = type opaque
%struct.write_commit_graph_context = type { %struct.repository*, %struct.object_directory*, i8*, %struct.packed_commit_list, i32, i32, i64, %struct.progress*, i32, i64, i8*, i32, i32, i8**, i8**, i8**, i32, %struct.commit_graph*, i8, %struct.topo_level_slab*, %struct.commit_graph_opts*, i64, %struct.bloom_filter_settings*, i32, i32, i32, i32 }
%struct.repository = type opaque
%struct.object_directory = type opaque
%struct.packed_commit_list = type { %struct.commit**, i64, i64 }
%struct.commit = type { %struct.object, i64, %struct.commit_list*, %struct.tree*, i32 }
%struct.object = type { i32, %struct.object_id }
%struct.commit_list = type { %struct.commit*, %struct.commit_list* }
%struct.tree = type opaque
%struct.commit_graph = type opaque
%struct.topo_level_slab = type { i32, i32, i32, i32** }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 14.0.0 (git@github.com:llvm/llvm-project.git 329fda39c507e8740978d10458451dcdb21563be)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !2, splitDebugInlining: false, nameTableKind: None, sysroot: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk", sdk: "MacOSX.sdk")
!1 = !DIFile(filename: "/var/folders/j6/jhbppx_x1050lwg8bmjxkt240000gp/T/compiler-explorer-compiler2023613-70730-zq61cy.18ivh/example.c", directory: "/private/var/folders/j6/jhbppx_x1050lwg8bmjxkt240000gp/T/compiler-explorer-compiler2023613-70730-zq61cy.18ivh")
!2 = !{!3}
!3 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !4, line: 47, baseType: !5)
!4 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/i386/_types.h", directory: "")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{i32 7, !"Dwarf Version", i32 4}
!7 = !{i32 2, !"Debug Info Version", i32 3}
!8 = !{i32 1, !"wchar_size", i32 4}
!9 = !{i32 7, !"PIC Level", i32 2}
!10 = !{i32 7, !"uwtable", i32 1}
!11 = !{i32 7, !"frame-pointer", i32 2}
!12 = !{!"clang version 14.0.0 (git@github.com:llvm/llvm-project.git 329fda39c507e8740978d10458451dcdb21563be)"}
!13 = distinct !DISubprogram(name: "write_graph_chunk_data", scope: !14, file: !14, line: 293, type: !15, scopeLine: 295, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !44)
!14 = !DIFile(filename: "/var/folders/j6/jhbppx_x1050lwg8bmjxkt240000gp/T/compiler-explorer-compiler2023613-70730-zq61cy.18ivh/example.c", directory: "")
!15 = !DISubroutineType(types: !16)
!16 = !{!17, !18, !43}
!17 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hashfile", file: !14, line: 24, size: 512, elements: !20)
!20 = !{!21, !22, !23, !24, !27, !31, !32, !35, !39, !42}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !19, file: !14, line: 25, baseType: !17, size: 32)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "check_fd", scope: !19, file: !14, line: 26, baseType: !17, size: 32, offset: 32)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !19, file: !14, line: 27, baseType: !5, size: 32, offset: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "tp", scope: !19, file: !14, line: 30, baseType: !25, size: 64, offset: 128)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = !DICompositeType(tag: DW_TAG_structure_type, name: "progress", file: !14, line: 30, flags: DIFlagFwdDecl)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !19, file: !14, line: 31, baseType: !28, size: 64, offset: 192)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !30)
!30 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "do_crc", scope: !19, file: !14, line: 32, baseType: !17, size: 32, offset: 256)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "crc32", scope: !19, file: !14, line: 33, baseType: !33, size: 32, offset: 288)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !34, line: 31, baseType: !5)
!34 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/_types/_uint32_t.h", directory: "")
!35 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_len", scope: !19, file: !14, line: 34, baseType: !36, size: 64, offset: 320)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !37, line: 46, baseType: !38)
!37 = !DIFile(filename: "/Users/jryans/Projects/LLVM/llvm/build-release-clang-lldb-14.0.0/lib/clang/14.0.0/include/stddef.h", directory: "")
!38 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !19, file: !14, line: 35, baseType: !40, size: 64, offset: 384)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "check_buffer", scope: !19, file: !14, line: 36, baseType: !40, size: 64, offset: 448)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!44 = !{}
!45 = !DILocalVariable(name: "f", arg: 1, scope: !13, file: !14, line: 293, type: !18)
!46 = !DILocation(line: 0, scope: !13)
!47 = !DILocalVariable(name: "data", arg: 2, scope: !13, file: !14, line: 294, type: !43)
!48 = !DILocation(line: 296, column: 43, scope: !13)
!49 = !DILocalVariable(name: "ctx", scope: !13, file: !14, line: 296, type: !50)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "write_commit_graph_context", file: !14, line: 250, size: 1600, elements: !52)
!52 = !{!53, !56, !59, !61, !99, !100, !101, !102, !103, !104, !108, !109, !110, !111, !113, !114, !115, !116, !119, !120, !121, !122, !123, !124, !125, !126, !136, !140, !141, !145, !146, !147, !148}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !51, file: !14, line: 251, baseType: !54, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DICompositeType(tag: DW_TAG_structure_type, name: "repository", file: !14, line: 251, flags: DIFlagFwdDecl)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "odb", scope: !51, file: !14, line: 252, baseType: !57, size: 64, offset: 64)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DICompositeType(tag: DW_TAG_structure_type, name: "object_directory", file: !14, line: 252, flags: DIFlagFwdDecl)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "graph_name", scope: !51, file: !14, line: 253, baseType: !60, size: 64, offset: 128)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "commits", scope: !51, file: !14, line: 255, baseType: !62, size: 192, offset: 192)
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "packed_commit_list", file: !14, line: 244, size: 192, elements: !63)
!63 = !{!64, !97, !98}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !62, file: !14, line: 245, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "commit", file: !14, line: 118, size: 576, elements: !68)
!68 = !{!69, !83, !87, !93, !96}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !67, file: !14, line: 119, baseType: !70, size: 320)
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object", file: !14, line: 104, size: 320, elements: !71)
!71 = !{!72, !73, !74, !75}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "parsed", scope: !70, file: !14, line: 105, baseType: !5, size: 1, flags: DIFlagBitField, extraData: i64 0)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !70, file: !14, line: 106, baseType: !5, size: 3, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !70, file: !14, line: 107, baseType: !5, size: 28, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "oid", scope: !70, file: !14, line: 108, baseType: !76, size: 288, offset: 32)
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_id", file: !14, line: 50, size: 288, elements: !77)
!77 = !{!78, !82}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !76, file: !14, line: 51, baseType: !79, size: 256)
!79 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 256, elements: !80)
!80 = !{!81}
!81 = !DISubrange(count: 32)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "algo", scope: !76, file: !14, line: 52, baseType: !17, size: 32, offset: 256)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "date", scope: !67, file: !14, line: 120, baseType: !84, size: 64, offset: 320)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "timestamp_t", file: !14, line: 7, baseType: !85)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !86, line: 32, baseType: !38)
!86 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/_types/_uintmax_t.h", directory: "")
!87 = !DIDerivedType(tag: DW_TAG_member, name: "parents", scope: !67, file: !14, line: 121, baseType: !88, size: 64, offset: 384)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "commit_list", file: !14, line: 113, size: 128, elements: !90)
!90 = !{!91, !92}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !89, file: !14, line: 114, baseType: !66, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !89, file: !14, line: 115, baseType: !88, size: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_tree", scope: !67, file: !14, line: 122, baseType: !94, size: 64, offset: 448)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "tree", file: !14, line: 122, flags: DIFlagFwdDecl)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !67, file: !14, line: 123, baseType: !5, size: 32, offset: 512)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !62, file: !14, line: 246, baseType: !36, size: 64, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !62, file: !14, line: 247, baseType: !36, size: 64, offset: 128)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "num_extra_edges", scope: !51, file: !14, line: 256, baseType: !17, size: 32, offset: 384)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "num_generation_data_overflows", scope: !51, file: !14, line: 257, baseType: !17, size: 32, offset: 416)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "approx_nr_objects", scope: !51, file: !14, line: 258, baseType: !38, size: 64, offset: 448)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !51, file: !14, line: 259, baseType: !25, size: 64, offset: 512)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "progress_done", scope: !51, file: !14, line: 260, baseType: !17, size: 32, offset: 576)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "progress_cnt", scope: !51, file: !14, line: 261, baseType: !105, size: 64, offset: 640)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !106, line: 31, baseType: !107)
!106 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Platforms/MacOSX.platform/Developer/SDKs/MacOSX.sdk/usr/include/_types/_uint64_t.h", directory: "")
!107 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "base_graph_name", scope: !51, file: !14, line: 263, baseType: !60, size: 64, offset: 704)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "num_commit_graphs_before", scope: !51, file: !14, line: 264, baseType: !17, size: 32, offset: 768)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "num_commit_graphs_after", scope: !51, file: !14, line: 265, baseType: !17, size: 32, offset: 800)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "commit_graph_filenames_before", scope: !51, file: !14, line: 266, baseType: !112, size: 64, offset: 832)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "commit_graph_filenames_after", scope: !51, file: !14, line: 267, baseType: !112, size: 64, offset: 896)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "commit_graph_hash_after", scope: !51, file: !14, line: 268, baseType: !112, size: 64, offset: 960)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "new_num_commits_in_base", scope: !51, file: !14, line: 269, baseType: !33, size: 32, offset: 1024)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "new_base_graph", scope: !51, file: !14, line: 270, baseType: !117, size: 64, offset: 1088)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "commit_graph", file: !14, line: 270, flags: DIFlagFwdDecl)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "append", scope: !51, file: !14, line: 272, baseType: !5, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "report_progress", scope: !51, file: !14, line: 273, baseType: !5, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "split", scope: !51, file: !14, line: 274, baseType: !5, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "changed_paths", scope: !51, file: !14, line: 275, baseType: !5, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "order_by_pack", scope: !51, file: !14, line: 276, baseType: !5, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "write_generation_data", scope: !51, file: !14, line: 277, baseType: !5, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "trust_generation_numbers", scope: !51, file: !14, line: 278, baseType: !5, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "topo_levels", scope: !51, file: !14, line: 280, baseType: !127, size: 64, offset: 1216)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "topo_level_slab", file: !14, line: 242, size: 192, elements: !129)
!129 = !{!130, !131, !132, !133}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "slab_size", scope: !128, file: !14, line: 242, baseType: !5, size: 32)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "stride", scope: !128, file: !14, line: 242, baseType: !5, size: 32, offset: 32)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "slab_count", scope: !128, file: !14, line: 242, baseType: !5, size: 32, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "slab", scope: !128, file: !14, line: 242, baseType: !134, size: 64, offset: 128)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "opts", scope: !51, file: !14, line: 281, baseType: !137, size: 64, offset: 1280)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !139)
!139 = !DICompositeType(tag: DW_TAG_structure_type, name: "commit_graph_opts", file: !14, line: 281, flags: DIFlagFwdDecl)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "total_bloom_filter_data_size", scope: !51, file: !14, line: 282, baseType: !36, size: 64, offset: 1344)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "bloom_settings", scope: !51, file: !14, line: 283, baseType: !142, size: 64, offset: 1408)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !144)
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: "bloom_filter_settings", file: !14, line: 283, flags: DIFlagFwdDecl)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "count_bloom_filter_computed", scope: !51, file: !14, line: 285, baseType: !17, size: 32, offset: 1472)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "count_bloom_filter_not_computed", scope: !51, file: !14, line: 286, baseType: !17, size: 32, offset: 1504)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "count_bloom_filter_trunc_empty", scope: !51, file: !14, line: 287, baseType: !17, size: 32, offset: 1536)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "count_bloom_filter_trunc_large", scope: !51, file: !14, line: 288, baseType: !17, size: 32, offset: 1568)
!149 = !DILocation(line: 297, column: 30, scope: !13)
!150 = !DILocation(line: 297, column: 38, scope: !13)
!151 = !DILocalVariable(name: "list", scope: !13, file: !14, line: 297, type: !65)
!152 = !DILocation(line: 298, column: 30, scope: !13)
!153 = !DILocation(line: 298, column: 38, scope: !13)
!154 = !DILocation(line: 298, column: 50, scope: !13)
!155 = !DILocation(line: 298, column: 58, scope: !13)
!156 = !DILocation(line: 298, column: 43, scope: !13)
!157 = !DILocalVariable(name: "last", scope: !13, file: !14, line: 298, type: !65)
!158 = !DILocalVariable(name: "num_extra_edges", scope: !13, file: !14, line: 299, type: !33)
!159 = !DILocation(line: 301, column: 2, scope: !13)
!160 = !DILocation(line: 301, column: 14, scope: !13)
!161 = !DILocalVariable(name: "packedDate", scope: !162, file: !14, line: 305, type: !163)
!162 = distinct !DILexicalBlock(scope: !13, file: !14, line: 301, column: 22)
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 64, elements: !164)
!164 = !{!165}
!165 = !DISubrange(count: 2)
!166 = !DILocation(line: 305, column: 12, scope: !162)
!167 = !DILocation(line: 306, column: 25, scope: !162)
!168 = !DILocation(line: 306, column: 42, scope: !162)
!169 = !DILocation(line: 306, column: 35, scope: !162)
!170 = !DILocation(line: 306, column: 3, scope: !162)
!171 = !DILocation(line: 308, column: 39, scope: !172)
!172 = distinct !DILexicalBlock(scope: !162, file: !14, line: 308, column: 7)
!173 = !DILocation(line: 308, column: 42, scope: !172)
!174 = !DILocation(line: 308, column: 7, scope: !172)
!175 = !DILocation(line: 308, column: 7, scope: !162)
!176 = !DILocation(line: 309, column: 8, scope: !172)
!177 = !DILocation(line: 310, column: 18, scope: !172)
!178 = !DILocation(line: 310, column: 26, scope: !172)
!179 = !DILocation(line: 310, column: 33, scope: !172)
!180 = !DILocation(line: 310, column: 5, scope: !172)
!181 = !DILocation(line: 309, column: 4, scope: !172)
!182 = !DILocation(line: 311, column: 30, scope: !162)
!183 = !DILocation(line: 311, column: 10, scope: !162)
!184 = !DILocalVariable(name: "tree", scope: !162, file: !14, line: 303, type: !185)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!186 = !DILocation(line: 0, scope: !162)
!187 = !DILocation(line: 312, column: 22, scope: !162)
!188 = !DILocation(line: 312, column: 16, scope: !162)
!189 = !DILocation(line: 312, column: 43, scope: !162)
!190 = !DILocation(line: 312, column: 3, scope: !162)
!191 = !DILocation(line: 314, column: 13, scope: !162)
!192 = !DILocation(line: 314, column: 21, scope: !162)
!193 = !DILocalVariable(name: "parent", scope: !162, file: !14, line: 302, type: !88)
!194 = !DILocation(line: 316, column: 8, scope: !195)
!195 = distinct !DILexicalBlock(scope: !162, file: !14, line: 316, column: 7)
!196 = !DILocation(line: 316, column: 7, scope: !162)
!197 = !DILocalVariable(name: "edge_value", scope: !162, file: !14, line: 304, type: !17)
!198 = !DILocation(line: 317, column: 4, scope: !195)
!199 = !DILocation(line: 319, column: 34, scope: !200)
!200 = distinct !DILexicalBlock(scope: !195, file: !14, line: 318, column: 8)
!201 = !DILocation(line: 319, column: 40, scope: !200)
!202 = !DILocation(line: 319, column: 47, scope: !200)
!203 = !DILocation(line: 320, column: 16, scope: !200)
!204 = !DILocation(line: 320, column: 24, scope: !200)
!205 = !DILocation(line: 321, column: 16, scope: !200)
!206 = !DILocation(line: 321, column: 24, scope: !200)
!207 = !DILocation(line: 319, column: 17, scope: !200)
!208 = !DILocation(line: 324, column: 19, scope: !209)
!209 = distinct !DILexicalBlock(scope: !200, file: !14, line: 324, column: 8)
!210 = !DILocation(line: 324, column: 8, scope: !200)
!211 = !DILocation(line: 325, column: 24, scope: !209)
!212 = !DILocation(line: 325, column: 16, scope: !209)
!213 = !DILocation(line: 325, column: 5, scope: !209)
