; ModuleID = 'example.c'
source_filename = "example.c"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx13.0.0"

%struct.S0 = type { [3 x i8], i8, i24, i16, i32, i32, i16 }

@csmith_sink_ = global i64 0, align 8, !dbg !0

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "csmith_sink_", scope: !2, file: !3, line: 12, type: !50, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 13.0.0 (git@github.com:llvm/llvm-project.git d7b669b3a30345cfcdb2fde2af6f48aa4b94845d)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !13, splitDebugInlining: false, nameTableKind: None, sysroot: "/")
!3 = !DIFile(filename: "example.c", directory: "/Users/jryans/Projects/Malleable/Experiments/Debug Info/Issues/Csmith/experiment-2023-01-17T11:17/4")
!4 = !{}
!5 = !{!6, !9, !11}
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !7, line: 207, baseType: !8)
!7 = !DIFile(filename: "LLVM/llvm/build-release-clang-lldb-13.0.0/lib/clang/13.0.0/include/stdint.h", directory: "/Users/jryans/Projects")
!8 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !7, line: 167, baseType: !10)
!10 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !7, line: 224, baseType: !12)
!12 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!13 = !{!0, !14, !22, !42, !46, !48}
!14 = !DIGlobalVariableExpression(var: !15, expr: !DIExpression())
!15 = distinct !DIGlobalVariable(name: "g_12", scope: !2, file: !3, line: 31, type: !16, isLocal: false, isDefinition: true)
!16 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 2400, elements: !19)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !7, line: 205, baseType: !18)
!18 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!19 = !{!20, !21, !20}
!20 = !DISubrange(count: 5)
!21 = !DISubrange(count: 6)
!22 = !DIGlobalVariableExpression(var: !23, expr: !DIExpression())
!23 = distinct !DIGlobalVariable(name: "g_15", scope: !2, file: !3, line: 32, type: !24, isLocal: false, isDefinition: true)
!24 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !25)
!25 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "S0", file: !3, line: 17, size: 192, elements: !26)
!26 = !{!27, !28, !30, !33, !34, !36, !37, !39, !40, !41}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "f0", scope: !25, file: !3, line: 18, baseType: !10, size: 15, flags: DIFlagBitField, extraData: i64 0)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "f1", scope: !25, file: !3, line: 19, baseType: !29, size: 8, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!29 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "f2", scope: !25, file: !3, line: 20, baseType: !31, size: 8, offset: 24)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !7, line: 226, baseType: !32)
!32 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "f3", scope: !25, file: !3, line: 21, baseType: !29, size: 18, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "f4", scope: !25, file: !3, line: 22, baseType: !35, size: 15, offset: 64, flags: DIFlagBitField, extraData: i64 64)
!35 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !29)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "f5", scope: !25, file: !3, line: 23, baseType: !29, size: 31, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "f6", scope: !25, file: !3, line: 24, baseType: !38, size: 4, offset: 128, flags: DIFlagBitField, extraData: i64 128)
!38 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "f7", scope: !25, file: !3, line: 25, baseType: !10, size: 13, offset: 132, flags: DIFlagBitField, extraData: i64 128)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "f8", scope: !25, file: !3, line: 26, baseType: !29, size: 10, offset: 145, flags: DIFlagBitField, extraData: i64 128)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "f9", scope: !25, file: !3, line: 27, baseType: !10, size: 10, offset: 160, flags: DIFlagBitField, extraData: i64 160)
!42 = !DIGlobalVariableExpression(var: !43, expr: !DIExpression())
!43 = distinct !DIGlobalVariable(name: "g_18", scope: !2, file: !3, line: 33, type: !44, isLocal: false, isDefinition: true)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !7, line: 96, baseType: !45)
!45 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!46 = !DIGlobalVariableExpression(var: !47, expr: !DIExpression())
!47 = distinct !DIGlobalVariable(name: "g_24", scope: !2, file: !3, line: 34, type: !11, isLocal: false, isDefinition: true)
!48 = !DIGlobalVariableExpression(var: !49, expr: !DIExpression())
!49 = distinct !DIGlobalVariable(name: "g_26", scope: !2, file: !3, line: 35, type: !9, isLocal: false, isDefinition: true)
!50 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !51)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !7, line: 98, baseType: !52)
!52 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!53 = !{i32 7, !"Dwarf Version", i32 4}
!54 = !{i32 2, !"Debug Info Version", i32 3}
!55 = !{i32 1, !"wchar_size", i32 4}
!56 = !{i32 7, !"PIC Level", i32 2}
!57 = !{i32 7, !"uwtable", i32 1}
!58 = !{i32 7, !"frame-pointer", i32 2}
!59 = !{!"clang version 13.0.0 (git@github.com:llvm/llvm-project.git d7b669b3a30345cfcdb2fde2af6f48aa4b94845d)"}
!60 = distinct !DISubprogram(name: "func_1", scope: !3, file: !3, line: 49, type: !61, scopeLine: 50, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !63)
!61 = !DISubroutineType(types: !62)
!62 = !{!11}
!63 = !{!64, !65, !66}
!64 = !DILocalVariable(name: "l_8", scope: !60, file: !3, line: 51, type: !51)
!65 = !DILocalVariable(name: "l_11", scope: !60, file: !3, line: 52, type: !44)
!66 = !DILocalVariable(name: "l_25", scope: !60, file: !3, line: 53, type: !67)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!68 = !DILocation(line: 0, scope: !60)
!69 = !DILocation(line: 54, column: 16, scope: !60)
!70 = !DILocation(line: 54, column: 13, scope: !60)
!71 = !{!72, !72, i64 0}
!72 = !{!"int", !73, i64 0}
!73 = !{!"omnipotent char", !74, i64 0}
!74 = !{!"Simple C/C++ TBAA"}
!75 = !DILocation(line: 55, column: 17, scope: !60)
!76 = !DILocation(line: 55, column: 12, scope: !60)
!77 = !DILocation(line: 55, column: 5, scope: !60)
!78 = distinct !DISubprogram(name: "func_2", scope: !3, file: !3, line: 64, type: !79, scopeLine: 65, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !82)
!79 = !DISubroutineType(types: !80)
!80 = !{!9, !51, !51, !9, !31, !81}
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !7, line: 172, baseType: !29)
!82 = !{!83, !84, !85, !86, !87, !88, !89, !91, !96, !98, !99, !100}
!83 = !DILocalVariable(name: "p_3", arg: 1, scope: !78, file: !3, line: 64, type: !51)
!84 = !DILocalVariable(name: "p_4", arg: 2, scope: !78, file: !3, line: 64, type: !51)
!85 = !DILocalVariable(name: "p_5", arg: 3, scope: !78, file: !3, line: 64, type: !9)
!86 = !DILocalVariable(name: "p_6", arg: 4, scope: !78, file: !3, line: 64, type: !31)
!87 = !DILocalVariable(name: "p_7", arg: 5, scope: !78, file: !3, line: 64, type: !81)
!88 = !DILocalVariable(name: "l_16", scope: !78, file: !3, line: 66, type: !51)
!89 = !DILocalVariable(name: "l_17", scope: !78, file: !3, line: 67, type: !90)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!91 = !DILocalVariable(name: "l_19", scope: !78, file: !3, line: 68, type: !92)
!92 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 1536, elements: !93)
!93 = !{!94, !95, !21}
!94 = !DISubrange(count: 8)
!95 = !DISubrange(count: 1)
!96 = !DILocalVariable(name: "l_23", scope: !78, file: !3, line: 69, type: !97)
